{
  "type": "Words",
  "id": "words_1771395749071",
  "slug": "letter-of-interest",
  "title": "Letter of Interest",
  "date": "2026-02-18T00:00:00.000Z",
  "description": "",
  "createdAt": "2026-02-18T06:24:20.308Z",
  "updatedAt": "2026-02-18T06:24:20.308Z",
  "isActive": true,
  "metadata": {},
  "text": "Dear Reginald,\n \nI am writing to apply for the Sales Assistant vacancy (vacancy number 40568) at Cow Hides and Co. Sales, as advertised on Trade Me.\n \nI was once a customer of Cow Hides and Co and was exhilarated and overjoyed by the quality of service I received. I am a snappy worker and I believe I would fit well into the company’s team culture. My secret weapon is my false leg.\n \nFor the past two years I have worked as a sales assistant at a busy shoe store, which has enabled me to develop excellent customer service skills. Despite an ever encroaching and almost violent jealousy of my customers (for their warm, bendable ankles) I have always placed their interests in one of my top five priorities, at all times. I am now looking for a new challenge that will provide me with the opportunity to further develop my retail sales career. I’d really like to learn how to look customers in the eye and talk at the same time. Just recently I have made a fabulous breakthrough (with the help of my psychodrama director) where I spent a day alone in the shoe store (on a Sunday) and simply stood at the till repeating my ‘script’ for customers. In a bout of eight hours I was able to repeat my welcome script (while looking a mannequin dead in the eye) a record 1066.7 times! We were both chuffed with my progress. I have attached the filmed footage to my email and would love to hear your feedback.\n \nIn support of my application I have attached a copy of my CV. It shows that I will bring important skills to the position, including:\n \n- Perfect teeth (I had braces from 2006-2008).\n- An ecstatic laugh.\n- Prestigious time management including always arriving to work an hour early to ‘get in the zone’.\n- A deep and sincere reverence for the Christian values which enrich our cultural landscape, though I am an atheist, by blood.\n\nI would enjoy having the opportunity to discuss my application with you and how I could use my skills to revolutionise Cow Hides and Co. Sales.\n  \nYours sincerely\n \nAmethyst \n"
}